// Generated by jextract

package opengl.windows.v10;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.ValueLayout.*;
public class _COMSTAT {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.paddingLayout(1).withName("fCtsHold"),
            MemoryLayout.paddingLayout(1).withName("fDsrHold"),
            MemoryLayout.paddingLayout(1).withName("fRlsdHold"),
            MemoryLayout.paddingLayout(1).withName("fXoffHold"),
            MemoryLayout.paddingLayout(1).withName("fXoffSent"),
            MemoryLayout.paddingLayout(1).withName("fEof"),
            MemoryLayout.paddingLayout(1).withName("fTxim"),
            MemoryLayout.paddingLayout(25).withName("fReserved")
        ),
        Constants$root.C_LONG$LAYOUT.withName("cbInQue"),
        Constants$root.C_LONG$LAYOUT.withName("cbOutQue")
    ).withName("_COMSTAT");
    public static MemoryLayout $LAYOUT() {
        return _COMSTAT.$struct$LAYOUT;
    }
    static final VarHandle cbInQue$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("cbInQue"));
    public static VarHandle cbInQue$VH() {
        return _COMSTAT.cbInQue$VH;
    }
    public static int cbInQue$get(MemorySegment seg) {
        return (int)_COMSTAT.cbInQue$VH.get(seg);
    }
    public static void cbInQue$set( MemorySegment seg, int x) {
        _COMSTAT.cbInQue$VH.set(seg, x);
    }
    public static int cbInQue$get(MemorySegment seg, long index) {
        return (int)_COMSTAT.cbInQue$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void cbInQue$set(MemorySegment seg, long index, int x) {
        _COMSTAT.cbInQue$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle cbOutQue$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("cbOutQue"));
    public static VarHandle cbOutQue$VH() {
        return _COMSTAT.cbOutQue$VH;
    }
    public static int cbOutQue$get(MemorySegment seg) {
        return (int)_COMSTAT.cbOutQue$VH.get(seg);
    }
    public static void cbOutQue$set( MemorySegment seg, int x) {
        _COMSTAT.cbOutQue$VH.set(seg, x);
    }
    public static int cbOutQue$get(MemorySegment seg, long index) {
        return (int)_COMSTAT.cbOutQue$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void cbOutQue$set(MemorySegment seg, long index, int x) {
        _COMSTAT.cbOutQue$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment allocate(ResourceScope scope) { return allocate(SegmentAllocator.nativeAllocator(scope)); }
    public static MemorySegment allocateArray(int len, ResourceScope scope) {
        return allocateArray(len, SegmentAllocator.nativeAllocator(scope));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, ResourceScope scope) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, scope); }
}


