// Generated by jextract

package opengl.windows.v10;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.ValueLayout.*;
public class _TP_CALLBACK_ENVIRON_V3 {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_LONG$LAYOUT.withName("Version"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("Pool"),
        Constants$root.C_POINTER$LAYOUT.withName("CleanupGroup"),
        Constants$root.C_POINTER$LAYOUT.withName("CleanupGroupCancelCallback"),
        Constants$root.C_POINTER$LAYOUT.withName("RaceDll"),
        Constants$root.C_POINTER$LAYOUT.withName("ActivationContext"),
        Constants$root.C_POINTER$LAYOUT.withName("FinalizationCallback"),
        MemoryLayout.unionLayout(
            Constants$root.C_LONG$LAYOUT.withName("Flags"),
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.paddingLayout(1).withName("LongFunction"),
                    MemoryLayout.paddingLayout(1).withName("Persistent"),
                    MemoryLayout.paddingLayout(30).withName("Private")
                )
            ).withName("s")
        ).withName("u"),
        Constants$root.C_LONG$LAYOUT.withName("CallbackPriority"),
        Constants$root.C_LONG$LAYOUT.withName("Size"),
        MemoryLayout.paddingLayout(32)
    ).withName("_TP_CALLBACK_ENVIRON_V3");
    public static MemoryLayout $LAYOUT() {
        return _TP_CALLBACK_ENVIRON_V3.$struct$LAYOUT;
    }
    static final VarHandle Version$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("Version"));
    public static VarHandle Version$VH() {
        return _TP_CALLBACK_ENVIRON_V3.Version$VH;
    }
    public static int Version$get(MemorySegment seg) {
        return (int)_TP_CALLBACK_ENVIRON_V3.Version$VH.get(seg);
    }
    public static void Version$set( MemorySegment seg, int x) {
        _TP_CALLBACK_ENVIRON_V3.Version$VH.set(seg, x);
    }
    public static int Version$get(MemorySegment seg, long index) {
        return (int)_TP_CALLBACK_ENVIRON_V3.Version$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void Version$set(MemorySegment seg, long index, int x) {
        _TP_CALLBACK_ENVIRON_V3.Version$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle Pool$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("Pool"));
    public static VarHandle Pool$VH() {
        return _TP_CALLBACK_ENVIRON_V3.Pool$VH;
    }
    public static MemoryAddress Pool$get(MemorySegment seg) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.Pool$VH.get(seg);
    }
    public static void Pool$set( MemorySegment seg, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.Pool$VH.set(seg, x);
    }
    public static MemoryAddress Pool$get(MemorySegment seg, long index) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.Pool$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void Pool$set(MemorySegment seg, long index, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.Pool$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle CleanupGroup$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("CleanupGroup"));
    public static VarHandle CleanupGroup$VH() {
        return _TP_CALLBACK_ENVIRON_V3.CleanupGroup$VH;
    }
    public static MemoryAddress CleanupGroup$get(MemorySegment seg) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.CleanupGroup$VH.get(seg);
    }
    public static void CleanupGroup$set( MemorySegment seg, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.CleanupGroup$VH.set(seg, x);
    }
    public static MemoryAddress CleanupGroup$get(MemorySegment seg, long index) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.CleanupGroup$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void CleanupGroup$set(MemorySegment seg, long index, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.CleanupGroup$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle CleanupGroupCancelCallback$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("CleanupGroupCancelCallback"));
    public static VarHandle CleanupGroupCancelCallback$VH() {
        return _TP_CALLBACK_ENVIRON_V3.CleanupGroupCancelCallback$VH;
    }
    public static MemoryAddress CleanupGroupCancelCallback$get(MemorySegment seg) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.CleanupGroupCancelCallback$VH.get(seg);
    }
    public static void CleanupGroupCancelCallback$set( MemorySegment seg, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.CleanupGroupCancelCallback$VH.set(seg, x);
    }
    public static MemoryAddress CleanupGroupCancelCallback$get(MemorySegment seg, long index) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.CleanupGroupCancelCallback$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void CleanupGroupCancelCallback$set(MemorySegment seg, long index, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.CleanupGroupCancelCallback$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static PTP_CLEANUP_GROUP_CANCEL_CALLBACK CleanupGroupCancelCallback (MemorySegment segment, ResourceScope scope) {
        return PTP_CLEANUP_GROUP_CANCEL_CALLBACK.ofAddress(CleanupGroupCancelCallback$get(segment), scope);
    }
    static final VarHandle RaceDll$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("RaceDll"));
    public static VarHandle RaceDll$VH() {
        return _TP_CALLBACK_ENVIRON_V3.RaceDll$VH;
    }
    public static MemoryAddress RaceDll$get(MemorySegment seg) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.RaceDll$VH.get(seg);
    }
    public static void RaceDll$set( MemorySegment seg, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.RaceDll$VH.set(seg, x);
    }
    public static MemoryAddress RaceDll$get(MemorySegment seg, long index) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.RaceDll$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void RaceDll$set(MemorySegment seg, long index, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.RaceDll$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle ActivationContext$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("ActivationContext"));
    public static VarHandle ActivationContext$VH() {
        return _TP_CALLBACK_ENVIRON_V3.ActivationContext$VH;
    }
    public static MemoryAddress ActivationContext$get(MemorySegment seg) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.ActivationContext$VH.get(seg);
    }
    public static void ActivationContext$set( MemorySegment seg, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.ActivationContext$VH.set(seg, x);
    }
    public static MemoryAddress ActivationContext$get(MemorySegment seg, long index) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.ActivationContext$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void ActivationContext$set(MemorySegment seg, long index, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.ActivationContext$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle FinalizationCallback$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("FinalizationCallback"));
    public static VarHandle FinalizationCallback$VH() {
        return _TP_CALLBACK_ENVIRON_V3.FinalizationCallback$VH;
    }
    public static MemoryAddress FinalizationCallback$get(MemorySegment seg) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.FinalizationCallback$VH.get(seg);
    }
    public static void FinalizationCallback$set( MemorySegment seg, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.FinalizationCallback$VH.set(seg, x);
    }
    public static MemoryAddress FinalizationCallback$get(MemorySegment seg, long index) {
        return (jdk.incubator.foreign.MemoryAddress)_TP_CALLBACK_ENVIRON_V3.FinalizationCallback$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void FinalizationCallback$set(MemorySegment seg, long index, MemoryAddress x) {
        _TP_CALLBACK_ENVIRON_V3.FinalizationCallback$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static PTP_SIMPLE_CALLBACK FinalizationCallback (MemorySegment segment, ResourceScope scope) {
        return PTP_SIMPLE_CALLBACK.ofAddress(FinalizationCallback$get(segment), scope);
    }
    public static class u {

        static final  GroupLayout u$union$LAYOUT = MemoryLayout.unionLayout(
            Constants$root.C_LONG$LAYOUT.withName("Flags"),
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.paddingLayout(1).withName("LongFunction"),
                    MemoryLayout.paddingLayout(1).withName("Persistent"),
                    MemoryLayout.paddingLayout(30).withName("Private")
                )
            ).withName("s")
        );
        public static MemoryLayout $LAYOUT() {
            return u.u$union$LAYOUT;
        }
        static final VarHandle Flags$VH = u$union$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("Flags"));
        public static VarHandle Flags$VH() {
            return u.Flags$VH;
        }
        public static int Flags$get(MemorySegment seg) {
            return (int)u.Flags$VH.get(seg);
        }
        public static void Flags$set( MemorySegment seg, int x) {
            u.Flags$VH.set(seg, x);
        }
        public static int Flags$get(MemorySegment seg, long index) {
            return (int)u.Flags$VH.get(seg.asSlice(index*sizeof()));
        }
        public static void Flags$set(MemorySegment seg, long index, int x) {
            u.Flags$VH.set(seg.asSlice(index*sizeof()), x);
        }
        public static class s {

            static final  GroupLayout u$s$struct$LAYOUT = MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.paddingLayout(1).withName("LongFunction"),
                    MemoryLayout.paddingLayout(1).withName("Persistent"),
                    MemoryLayout.paddingLayout(30).withName("Private")
                )
            );
            public static MemoryLayout $LAYOUT() {
                return s.u$s$struct$LAYOUT;
            }
            public static long sizeof() { return $LAYOUT().byteSize(); }
            public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
            public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
            }
            public static MemorySegment allocate(ResourceScope scope) { return allocate(SegmentAllocator.nativeAllocator(scope)); }
            public static MemorySegment allocateArray(int len, ResourceScope scope) {
                return allocateArray(len, SegmentAllocator.nativeAllocator(scope));
            }
            public static MemorySegment ofAddress(MemoryAddress addr, ResourceScope scope) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, scope); }
        }

        public static MemorySegment s$slice(MemorySegment seg) {
            return seg.asSlice(0, 4);
        }
        public static long sizeof() { return $LAYOUT().byteSize(); }
        public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
        public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
        }
        public static MemorySegment allocate(ResourceScope scope) { return allocate(SegmentAllocator.nativeAllocator(scope)); }
        public static MemorySegment allocateArray(int len, ResourceScope scope) {
            return allocateArray(len, SegmentAllocator.nativeAllocator(scope));
        }
        public static MemorySegment ofAddress(MemoryAddress addr, ResourceScope scope) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, scope); }
    }

    public static MemorySegment u$slice(MemorySegment seg) {
        return seg.asSlice(56, 4);
    }
    static final VarHandle CallbackPriority$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("CallbackPriority"));
    public static VarHandle CallbackPriority$VH() {
        return _TP_CALLBACK_ENVIRON_V3.CallbackPriority$VH;
    }
    public static int CallbackPriority$get(MemorySegment seg) {
        return (int)_TP_CALLBACK_ENVIRON_V3.CallbackPriority$VH.get(seg);
    }
    public static void CallbackPriority$set( MemorySegment seg, int x) {
        _TP_CALLBACK_ENVIRON_V3.CallbackPriority$VH.set(seg, x);
    }
    public static int CallbackPriority$get(MemorySegment seg, long index) {
        return (int)_TP_CALLBACK_ENVIRON_V3.CallbackPriority$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void CallbackPriority$set(MemorySegment seg, long index, int x) {
        _TP_CALLBACK_ENVIRON_V3.CallbackPriority$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle Size$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("Size"));
    public static VarHandle Size$VH() {
        return _TP_CALLBACK_ENVIRON_V3.Size$VH;
    }
    public static int Size$get(MemorySegment seg) {
        return (int)_TP_CALLBACK_ENVIRON_V3.Size$VH.get(seg);
    }
    public static void Size$set( MemorySegment seg, int x) {
        _TP_CALLBACK_ENVIRON_V3.Size$VH.set(seg, x);
    }
    public static int Size$get(MemorySegment seg, long index) {
        return (int)_TP_CALLBACK_ENVIRON_V3.Size$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void Size$set(MemorySegment seg, long index, int x) {
        _TP_CALLBACK_ENVIRON_V3.Size$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment allocate(ResourceScope scope) { return allocate(SegmentAllocator.nativeAllocator(scope)); }
    public static MemorySegment allocateArray(int len, ResourceScope scope) {
        return allocateArray(len, SegmentAllocator.nativeAllocator(scope));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, ResourceScope scope) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, scope); }
}


